[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/GRJ03/Numpy-Pandas/blob/main/Pandas.ipynb)

In [ ]:
import pandas as pd

In [ ]:
#.csv files are comma separated values and .tsv files are tab separated value
#pandas me bohot bada dataset (excel) ko uplad krke manipulate/clean/analyse data
list=[1,2,3,4,5]
#1D DS
s1=pd.Series(list)
#2D DS
d1=pd.DataFrame(list)
print(s1)
print(d1)
print(type(s1))

list1=[1,2,3,4,5]
list2=[44,2,3,4,5]
list3=[3,2,3,4,5]
dfinal=pd.DataFrame((list1,list2,list3))
print(dfinal)

0    1
1    2
2    3
3    4
4    5
dtype: int64
   0
0  1
1  2
2  3
3  4
4  5
<class 'pandas.core.series.Series'>
    0  1  2  3  4
0   1  2  3  4  5
1  44  2  3  4  5
2   3  2  3  4  5

In [ ]:
#can manually assign indexn(has columns)
#by default 0 1 2 3 as index
#print series
dic1={'a':[2,2,3,4],'b':[3,4,4,4]}
s2=pd.Series(dic1)
print(s2)
#print dataframe(2d ds)
dic1={'a':[2,2,3,4],'b':[3,4,4,4]}
d2=pd.DataFrame(dic1,columns=['a'],index=['1','2','3','4'])
d3=pd.DataFrame(dic1,columns=['a','b'],index=['a','b','c','d'])
print(d2)
print(d3)
# here column row in dataframe, ese matrix wgera me row column hoyta h
print(d3['a']['c'])

a    [2, 2, 3, 4]
b    [3, 4, 4, 4]
dtype: object
   a
1  2
2  2
3  3
4  4
   a  b
a  2  3
b  2  4
c  3  4
d  4  4
3

# Arithmetic OPERATIONS

In [ ]:
d3=pd.DataFrame({'a':[1,2,3,4,5],'b':[9,8,7,6,5], 'c':[3,4,5,5,5]})
print(d3)
#to add column
d3['e']=d3['b']-d3['a']
print(d3)
d3['d']=d3['e']>=6
print(d3)

   a  b  c
0  1  9  3
1  2  8  4
2  3  7  5
3  4  6  5
4  5  5  5
   a  b  c  e
0  1  9  3  8
1  2  8  4  6
2  3  7  5  4
3  4  6  5  2
4  5  5  5  0
   a  b  c  e      d
0  1  9  3  8   True
1  2  8  4  6   True
2  3  7  5  4  False
3  4  6  5  2  False
4  5  5  5  0  False

#INSERT

In [ ]:
# khud se nayi list ko as a col insert krna ho toh
d4=pd.DataFrame({'a':[1,2,3,4,5],'b':[9,8,7,6,5], 'c':[3,4,5,5,5]})
d4.insert(3,'d',[2,3,43,5,3])
print(d4)
d4.insert(4,'e',d4['b'])
print(d4)

   a  b  c   d
0  1  9  3   2
1  2  8  4   3
2  3  7  5  43
3  4  6  5   5
4  5  5  5   3
   a  b  c   d  e
0  1  9  3   2  9
1  2  8  4   3  8
2  3  7  5  43  7
3  4  6  5   5  6
4  5  5  5   3  5

# DELETE

In [ ]:

d6=pd.DataFrame({'a':[1,2,3,4,5],'b':[9,8,7,6,5], 'c':[3,4,5,5,5]})
d6.pop('c')
print(d6)
del d6['a']
print(d6)

   a  b
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5
   b
0  9
1  8
2  7
3  6
4  5

# Write CSV file

In [ ]:
#dataframe ko csv me convert and csv ko excel me open kr skte

d11=pd.DataFrame({'a':[1,2,3,4,5],'b':[9,8,7,6,5], 'c':[3,4,5,5,5]})
d11.to_csv("GRJ_1ST_CSV.csv",header=['A','B','C'],index=False)
# d11.to_csv("GRJ_1ST_CSV.csv",header=['A','B','C'],index=True)
#header matlab column ka header jo excel me display hoga meri jaannn
#index=false ka matlab h, index ka alag se column nhi bnega
print(d11)

   a  b  c
0  1  9  3
1  2  8  4
2  3  7  5
3  4  6  5
4  5  5  5

In [ ]:
#TO OPEN/Download EXCEL FILE from collab
from google.colab import files
files.download("GRJ_1ST_CSV.csv")

#READ CSV FILE

In [ ]:
#browse krke le aa excel file colab pe
#to use operations on excel file, we do this
# agar tsv(tab seprated values) hoti to read wlo me ek aur agrumenet leta, i.e. sep='\t'
data=pd.read_csv("Data.csv")
# print(data)

In [ ]:
#header neeche shift, is bkl method ka kabhi use nhi ayega meri jaan
# data=pd.read_csv("GRJ_1ST_CSV.csv",header=None)
print(data)
#tells rows ka kya scene h
data.index
#to see all columnn names
data.columns
#har column ka mean , sd , etc nikal k rkh dega
data.describe()
#if dataset is veryyyyy large(most cases) ,
#use this to see only first 5 rows or jitna dekhna chahta h
data.head(2)
#for last
data.tail(1)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

  Country   Age   Salary Purchased
9  France  37.0  67000.0       Yes

SLICING OF DATA

In [ ]:
#rows k liye
print(data[1:4])

   Country   Age   Salary Purchased
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No

In [ ]:
import numpy as np

#Dataset to numpy array

In [ ]:
numpy_arr=np.asarray(data)
print(numpy_arr)
print(data)

[['France' 44.0 72000.0 'No']
 ['Spain' 27.0 48000.0 'Yes']
 ['Germany' 30.0 54000.0 'No']
 ['Spain' 38.0 61000.0 'No']
 ['Germany' 40.0 nan 'Yes']
 ['France' 35.0 58000.0 'Yes']
 ['Spain' nan 52000.0 'No']
 ['France' 48.0 79000.0 'Yes']
 ['Germany' 50.0 83000.0 'No']
 ['France' 37.0 67000.0 'Yes']]
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

#MOST IMP YE PADH LE DHANG **SE**

In [ ]:
# jab specific row aur column proint krwana ho
#isme we pass row as index and column as name, tabhi row pw slicing possible and column p nhi
data.loc[[2,3],['A']]
#IF USE SLICING TAB NO INSIDE []
data.loc[2:,['A','B']]
data.loc[0:5,['C','B']]

In [ ]:
# agar .values lga de to we can print everything in form of array
data.loc[1:4,['A','B','C']]
data.loc[1:4,['A','B','C']].values

#ILOC(most used bcccc)

In [ ]:
#i loc mane index ki location meri jaaannn
#isme we pass row and col both as index, tabhi dono pw slicing possible h,
data.iloc[[2,3],[1,2]]
data.iloc[1:,-1]
data.iloc[0:,:2]
# in datasets , jo y hota h(i.e. depoendent variable) ,
#in general wo last column me hota h and need we need accces that , we use
data.iloc[:,-1]

# DROP/DELETE ROW AND COL

In [ ]:
#we need to define jis axis k along drop
# axis=0 ,i.e y axis and axis=1, i.e. x axis
#wahi data update hoga

#we need to define kis axis k along prsent h jisse drop krna h
#col drop
data.drop('C',axis=1)
#row drop
data.drop(0,axis=0)

In [ ]:
ds=pd.read_csv("Data.csv")
print(ds)
ds.iloc[:,-1]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

#DROP COL/ROW WITH MISSING VALUE

In [ ]:
# #to check data set me missing values kaha pr ha,
# print(ds.isnull().sum())
# #kitne missinhg value h har column me
# print(ds.isnull())

#to drop col/row with missing values
ds1=ds.dropna()
#by default row hatega
print(ds1)
print("")
#col hatega
ds2=ds.dropna(axis=1)
print(ds2)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

   Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes
5   France       Yes
6    Spain        No
7   France       Yes
8  Germany        No
9   France       Yes

In [ ]:
# jis col m missing val hoga us row uda dega
ds3=ds.dropna(subset=['Age'])
print(ds3)
print("      ")
ds4=ds.dropna(subset=['Country'])
print(ds4)
print("")
ds.dropna(inplace=True)
print(ds)

#fill in the missing values

In [ ]:
#jaha bhi khali ho
ds6=ds.fillna("grj")
print(ds6)
print("")
ds7=ds.fillna(11)
print(ds7)

In [ ]:
#forwardfill and backwardfill
#f fill me uper wle row ki vakue niche pel dega
ds8=ds.fillna(method="ffill")
print(ds8)
print()
#b fill me uper niche row ki vakue niche pel dega
ds9=ds.fillna(method="bfill")
print(ds9)

In [ ]:
# usko hi modify
ds.fillna("grj",inplace=True)
print(ds)

#REPLACE

In [ ]:
# for e.g. yes ko 1 se no ko 0 se, inplace
ds.replace(to_replace=['No','Yes'],value=[0,1],inplace=True)
print(ds)
print()
ds11=ds.replace(to_replace=['Germany','France'],value='India')
print(ds11)

#INTERPOLATE(man se value interpolate krke fil krega)

In [ ]:
ds.interpolate(method='linear',inplace=True)
ds.interpolate(inplace=True)
print(ds)

#we use scikit learn to fill the missing values

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  59500.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  41.5  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

<ipython-input-29-e37d8b3e4903>:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  ds.interpolate(method='linear',inplace=True)
<ipython-input-29-e37d8b3e4903>:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  ds.interpolate(inplace=True)